# Core packages installed via pacman.
# Keep entries sorted alphabetically and document rationale in docs/choices.md.

alacritty
base-devel
bash-completion
bat
blueman
bluez
bluez-utils
brightnessctl
btop
dust
eza
fastfetch
fcitx5
fcitx5-gtk
fcitx5-qt
fd
firefox
ghostty
git
github-cli
gnome-calculator
gnome-calendar
gnome-disk-utility
gnome-keyring
grim
gum
gvfs
gvfs-mtp
gvfs-nfs
gvfs-smb
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
imv
jq
kitty
luarocks
mako
mise
nautilus
network-manager-applet
networkmanager
neovim
nodejs
npm
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
openssh
pamixer
pavucontrol
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
polkit-gnome
python-pip
ripgrep
satty
sddm
slurp
starship
swaybg
swayosd
tldr
tree-sitter-cli
ttf-cascadia-mono-nerd
ttf-jetbrains-mono-nerd
ufw
uwsm
waybar
wireplumber
wl-clipboard
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
yay
zoxide
